In [30]:
%matplotlib inline
import pandas as pd
import numpy as np

In [31]:
title = pd.read_csv('titles.csv')
cast = pd.read_csv('cast.csv')
rel_dates = pd.read_csv('release_dates.csv')

In [32]:
title.head(2)

                title  year
0  Tasveer Mere Sanam  1996
1            Only You  1994

In [33]:
cast.head(3)

                 title  year      name   type        character     n
0       Closet Monster  2015  Buffy #1  actor          Buffy 4  31.0
1      Suuri illusioni  1985    Homo $  actor           Guests  22.0
2  Battle of the Sexes  2017   $hutter  actor  Bobby Riggs Fan  10.0

In [34]:
rel_dates.head(3)

                   title  year   country        date
0  #73, Shaanthi Nivaasa  2007     India  2007-06-15
1                  #BKKY  2016  Cambodia  2017-10-12
2                #Beings  2015   Romania  2015-01-29

#How many movies are listed in the titles dataframe?

In [35]:
title[['title']].count()

title    244914
dtype: int64

#What are the earliest two films listed in the titles dataframe?

In [36]:
earliest = title.sort_values('year')

In [37]:
[i for i in earliest['title'].head(2) ]

['Miss Jerry', 'The Startled Lover']

#How many movies have the title "Hamlet"?

In [38]:
len(title[title['title']=='Hamlet'])

20

#How many movies are titled "North by Northwest"?

In [39]:
len(title[title['title']=='North by Northwest'])

1

#When was the first movie titled "Hamlet" made?

In [40]:
title[title['title']=='Hamlet'].sort_values('year').iloc[0,1]

1910

#List all of the "Treasure Island" movies from earliest to most recent.

In [41]:
title[title.title == 'Treasure Island'].sort_values('year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

#How many movies were made in the year 1950?

In [42]:
title[title['year'] == 1950].shape[0]

1113

#How many movies were made in the year 1960?

In [44]:
len(title[title['year'] == 1960])

1549

#How many movies were made from 1950 through 1959?

In [45]:
len(title[(title['year']>=1950) & (title['year']<=1959)])

12934

#In what years has a movie titled "Batman" been released?

In [46]:
years = title[title.title == "Batman"]
years

         title  year
39349   Batman  1943
240896  Batman  1989

#How many roles were there in the movie "Inception"?

In [47]:
len(cast[cast.title == 'Inception'])

78

#How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [48]:
x = cast[cast.title == 'Inception']
y = x[x.n.isnull()]
len(y)

27

#But how many roles in the movie "Inception" did receive an "n" value?

In [49]:
z = cast[cast.title == 'Inception']
c = z[z.n.notnull()]
len(c)

51

#Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [53]:
z = cast[cast.title=='North by Northwest']
x = z[z.n.notnull()]
x

                      title  year  ...                    character     n
206471   North by Northwest  1959  ...               Captain Junket  15.0
356707   North by Northwest  1959  ...                The Professor   5.0
464736   North by Northwest  1959  ...                    Dr. Cross  13.0
665768   North by Northwest  1959  ...                        Licht  11.0
871426   North by Northwest  1959  ...           Roger O. Thornhill   1.0
1275337  North by Northwest  1959  ...                      Leonard   8.0
1384780  North by Northwest  1959  ...  Charley - Chicago Policeman  16.0
1457165  North by Northwest  1959  ...              Phillip Vandamm   3.0
1508344  North by Northwest  1959  ...               Sergeant Flamm  14.0
1695173  North by Northwest  1959  ...              Lester Townsend   7.0
1811387  North by Northwest  1959  ...              Victor Larrabee  10.0
2295714  North by Northwest  1959  ...                   Auctioneer  12.0
2447081  North by Northwest  1959  ...                     Valerian   9.0
3048272  North by Northwest  1959  ...                Mrs. Townsend   6.0
3157232  North by Northwest  1959  ...              Clara Thornhill   4.0
3518333  North by Northwest  1959  ...                  Eve Kendall   2.0

[16 rows x 6 columns]

#Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [54]:
cast[(cast.title == "Sleuth") & (cast.year == 1972)].sort_values('n')

          title  year  ...                   character    n
1705394  Sleuth  1972  ...                 Andrew Wyke  1.0
326773   Sleuth  1972  ...                 Milo Tindle  2.0
373876   Sleuth  1972  ...           Inspector Doppler  3.0
1465483  Sleuth  1972  ...  Detective Sergeant Tarrant  4.0
2724553  Sleuth  1972  ...             Marguerite Wyke  5.0
1448690  Sleuth  1972  ...      Police Constable Higgs  6.0

[6 rows x 6 columns]

#Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [56]:
s = cast[(cast.title == "Sleuth") & (cast.year == 2007)].sort_values('n')
a = s[s.n.notnull()]
a

          title  year           name   type    character    n
326774   Sleuth  2007  Michael Caine  actor       Andrew  1.0
1293634  Sleuth  2007       Jude Law  actor         Milo  2.0
1805907  Sleuth  2007  Harold Pinter  actor  Man on T.V.  3.0

#How many roles were credited in the silent 1921 version of Hamlet?

In [57]:
len(cast[(cast.title == 'Hamlet') & (cast.year == 1921)])

9

#How many roles were credited in Branaghâ€™s 1996 Hamlet?

In [58]:
len(cast[(cast.title == 'Hamlet') & (cast.year == 1996)])

54

#How many "Hamlet" roles have been listed in all film credits through history?

In [59]:
len(cast[(cast.title == 'Hamlet')])

342

#How many people have played an "Ophelia"?

In [60]:
cast.head(1)

            title  year      name   type character     n
0  Closet Monster  2015  Buffy #1  actor   Buffy 4  31.0

#How many people have played a role called "The Dude"?

In [61]:
len(cast[cast.character == "Ophelia"])

117

#How many people have played a role called "The Stranger"?

In [62]:
len(cast[cast.character == 'The Stranger'])

212

#How many roles has Sidney Poitier played throughout his career?

In [63]:
cast.head(3)

                 title  year      name   type        character     n
0       Closet Monster  2015  Buffy #1  actor          Buffy 4  31.0
1      Suuri illusioni  1985    Homo $  actor           Guests  22.0
2  Battle of the Sexes  2017   $hutter  actor  Bobby Riggs Fan  10.0

In [64]:
len(cast[cast.name == "Sidney Poitier"])

43

#How many roles has Judi Dench played?

In [65]:
len(cast[cast.name == "Judi Dench"])

55

#List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [66]:
cast[(cast.name == "Cary Grant") & (cast.n == 2) & (cast.year <= 1940)].sort_values('year')

                         title  year  ...                  character    n
871418        Madame Butterfly  1932  ...  Lieutenant B.F. Pinkerton  2.0
871454       The Woman Accused  1933  ...             Jeffrey Baxter  2.0
871446  The Eagle and the Hawk  1933  ...              Henry Crocker  2.0
871412            I'm No Angel  1933  ...               Jack Clayton  2.0
871436      She Done Him Wrong  1933  ...           Captain Cummings  2.0
871393          Born to Be Bad  1934  ...             Malcolm Trevor  2.0
871455     Thirty Day Princess  1934  ...         Porter Madison III  2.0
871440         Sylvia Scarlett  1935  ...              Jimmy Monkley  2.0
871401           Enter Madame!  1935  ...          Gerald Fitzgerald  2.0
871465       Wings in the Dark  1935  ...                 Ken Gordon  2.0
871463         Wedding Present  1936  ...              Charlie Mason  2.0
871464     When You're in Love  1937  ...               Jimmy Hudson  2.0
871443         The Awful Truth  1937  ...             Jerry Warriner  2.0
871453   The Toast of New York  1937  ...                  Nick Boyd  2.0
871459                  Topper  1937  ...               George Kerby  2.0
871408                 Holiday  1938  ...                Johnny Case  2.0
871394        Bringing Up Baby  1938  ...                      David  2.0
871413            In Name Only  1939  ...                Alec Walker  2.0
871423        My Favorite Wife  1940  ...                 Nick Arden  2.0

[19 rows x 6 columns]

#List the leading roles that Cary Grant played in the 1940s in order by year.

In [67]:
cast.head(2)

             title  year      name   type character     n
0   Closet Monster  2015  Buffy #1  actor   Buffy 4  31.0
1  Suuri illusioni  1985    Homo $  actor    Guests  22.0

In [68]:
cast[(cast.name == "Cary Grant") & (cast.n == 1) & (cast.year <= 1940)].sort_values('year')

                                    title  year  ...           character    n
871409                       Hot Saturday  1932  ...     Romer Sheffield  1.0
871404                      Gambling Ship  1933  ...          Ace Corbin  1.0
871415                   Kiss and Make-Up  1934  ...   Dr. Maurice Lamar  1.0
871417               Ladies Should Listen  1934  ...    Julian De Lussac  1.0
871449                   The Last Outpost  1935  ...     Michael Andrews  1.0
871391                     Big Brown Eyes  1936  ...          Danny Barr  1.0
871442  The Amazing Quest of Ernest Bliss  1936  ...        Ernest Bliss  1.0
871406                          Gunga Din  1939  ...              Cutter  1.0
871431             Only Angels Have Wings  1939  ...        Geoff Carter  1.0
871407                    His Girl Friday  1940  ...        Walter Burns  1.0
871448            The Howards of Virginia  1940  ...         Matt Howard  1.0
871450             The Philadelphia Story  1940  ...  C. K. Dexter Haven  1.0

[12 rows x 6 columns]

#How many roles were available for actors in the 1950s?

In [69]:
len(cast[(cast.type == 'actor') & (cast.year == 1950)])

16760

#How many roles were available for actresses in the 1950s?

In [70]:
cast[(cast.type == 'actress') & (cast.year < 1960) & (cast.year >= 1950)].character.count()

57733

#How many leading roles (n=1) were available from the beginning of film history through 1980?

In [71]:
len(cast[(cast.n == 1) & (cast.year <= 1980)])

65140

#How many non-leading roles were available through from the beginning of film history through 1980?

In [72]:
len(cast[(cast.n != 1) & (cast.year <= 1980)])

1117667

#How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [73]:
len(cast[(cast.n.isna()) & (cast.year <= 1980)])

448347